{"title": "future-plans", "heading": "\u4eca\u5f8c\u306e\u65b9\u91dd", "path": "ideas/future-plans", "html_text": "<h1>\u4eca\u5f8c\u306e\u65b9\u91dd</h1>\n<p>\u4eca\u5f8c\u3084\u308a\u305f\u3044\u3053\u3068\u3068\u304b\u3002\u968f\u6642\u66f4\u65b0</p>\n<h2>\u3053\u306e\u30b5\u30a4\u30c8\u306b\u3064\u3044\u3066</h2>\n<p>\u96d1\u591a\u306b\u8272\u3005\u60c5\u5831\u3092\u30e1\u30e2\u3057\u3066\u3044\u3053\u3046\u304b\u306a\u3068\u601d\u3063\u3066\u3044\u307e\u3059\u3002<br />\nQiita\u3068\u304bZenn\u3068\u304bNote\u3068\u304b\u3042\u3093\u307e\u3057\u808c\u306b\u5408\u308f\u306a\u304b\u3063\u305f\u306e\u3067\u3042\u308b\u7a0b\u5ea6\u60c5\u5831\u304c\u6e9c\u307e\u3063\u305f\u3089 <a href=\"https://dev.to/sumeshi\">dev.to</a> \u306b\u3067\u3082\u516c\u958b\u3057\u3088\u3063\u304b\u306a\u3002\u3068\u601d\u3063\u3066\u308b\u3051\u3069\u7d50\u5c40\u3057\u3066\u306a\u3044\u3002</p>\n<p>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u95a2\u9023\u306e\u81ea\u5206\u7528\u30e1\u30e2\u3068\u304b\u3001\u8da3\u5473\u958b\u767a\u306b\u3064\u3044\u3066\u306e\u30e1\u30e2\u3092\u66f8\u3044\u3066\u3044\u304f\u4e88\u5b9a\u3067\u3059\u3002<br />\n\u3053\u306e\u30b5\u30a4\u30c8\u81ea\u4f53\u304c\u81ea\u5206\u306e\u4f5c\u3063\u305f\u30c4\u30fc\u30eb\u306e\u5b9f\u9a13\u5834\u306a\u306e\u3067\u3001\u305d\u306e\u3046\u3061\u30d6\u30e9\u30c3\u30b7\u30e5\u30a2\u30c3\u30d7\u3057\u3066\u516c\u958b\u3067\u304d\u305f\u3089\u5b09\u3057\u3044\u304b\u306a\u3002\u4eca\u306e\u3068\u3053 <a href=\"https://sumeshi.github.io/posts/md2api\">md2api</a> \u304f\u3089\u3044\u3057\u304b\u307e\u3068\u3082\u306a\u30c4\u30fc\u30eb\u306a\u3044\u3051\u3069\u3002</p>\n<h2>\u4eca\u53d6\u308a\u7d44\u3093\u3067\u308b\u3053\u3068</h2>\n<h3>sumeshi.github.io \u306e\u958b\u767a</h3>\n<p>Nuxt3\u306b\u79fb\u884c\u3057\u3088\u3046\u3068\u601d\u3063\u3066\u308b\u3051\u3069\u7d50\u5c40\u3067\u304d\u3066\u306a\u3044\u3002<br />\n\u30d5\u30ed\u30f3\u30c8\u30a8\u30f3\u30c9\u3082\u96e2\u308c\u305f\u306e\u3067\u30c8\u30ec\u30f3\u30c9\u304c\u308f\u304b\u3089\u306a\u3044\u3002\u56f0\u3063\u305f\u3002</p>\n<h3>\u516c\u958b\u3057\u3066\u308b\u30c4\u30fc\u30eb\u7fa4\u306e\u30e1\u30f3\u30c6</h3>\n<p>*2es\u3068\u304b\u3001ntfs*\u3068\u304b<br />\n\u52d5\u4f5c\u6761\u4ef6Python3.7\u4ee5\u4e0a\u3068\u304b\u306b\u3057\u3066\u305f\u3051\u3069\u3001\u5f8c\u65b9\u4e92\u63db\u6027\u4fdd\u3064\u3068\u65b0\u3057\u3044\u6587\u6cd5\u4f7f\u3048\u306a\u3044\u3057\u3082\u3046\u3044\u3044\u3088\u306d\u3002<br />\n\u53e4\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u4f7f\u3044\u305f\u3044\u4eba\u306f\u30d5\u30a9\u30fc\u30af\u3057\u3066\u308b\u3060\u308d\u3046\u304b\u3089\u77e5\u308a\u307e\u305b\u3093\u3002\u8fd1\u304f3.9\u4ee5\u4e0a\u306b\u3059\u308b\u3068\u601d\u3044\u307e\u3059\u3002  </p>\n<h3>\u7c21\u6613\u5168\u6587\u691c\u7d22\u30a8\u30f3\u30b8\u30f3\u306e\u958b\u767a</h3>\n<p>Elasticsearch\u306e\u7c21\u6613\u7248\u3063\u307d\u3044\u306e\u3092\u76ee\u6307\u3057\u3066\u307e\u3059\u3002</p>\n<p>\u3082\u3068\u3082\u3068\u5b66\u90e8\u751f\u306e\u3068\u304d\u306b\u81ea\u7136\u8a00\u8a9e\u51e6\u7406\u3068\u304b\u3084\u3063\u3066\u305f\u3053\u3068\u3082\u3042\u3063\u3066\u3001<br />\n\u591a\u5c11\u30ce\u30a6\u30cf\u30a6\u304c\u3042\u308b\u306e\u3067\u3084\u3063\u3066\u307f\u3088\u3063\u304b\u306a\u3063\u3066\u611f\u3058\u3067\u3059\u3002</p>\n<p><a href=\"https://sumeshi.github.io\">sumeshi.github.io</a> \u306e\u691c\u7d22\u6a5f\u80fd\u3092\u5b9f\u73fe\u3059\u308b\u3064\u3044\u3067\u306b\u6a5f\u80fd\u81ea\u4f53\u3092\u72ec\u7acb\u3055\u305b\u3066\u30e9\u30a4\u30d6\u30e9\u30ea\u306b\u3057\u3061\u3083\u304a\u3063\u3066\u601d\u3063\u3066\u307e\u3059\u3002</p>\n<h3>\u30d5\u30a1\u30b9\u30c8\u30d5\u30a9\u30ec\u30f3\u30b8\u30c3\u30af\u7528\u30c4\u30fc\u30eb\u306e\u958b\u767a</h3>\n<p><a href=\"https://github.com/sumeshi\">GitHub</a> \u3067\u516c\u958b\u3057\u3066\u308b\u30c4\u30fc\u30eb\u7fa4\u306e\u6a5f\u80fd\u3092\u7d71\u5408\u3057\u3066\u53ef\u8996\u5316\u307e\u3067\u3084\u3063\u3066\u304f\u308c\u308b\u3088\u3046\u306a\u611f\u3058\u306e\u3092\u8003\u3048\u3066\u307e\u3059\u3002\n\u5927\u5b66\u9662\u306e\u3068\u304d\u306b\u3084\u3063\u3066\u305f\u7814\u7a76\u3092\u500b\u4eba\u306e\u8da3\u5473\u3068\u3057\u3066\u5b8c\u6210\u3055\u305b\u3066\u307f\u305f\u3044\u306a\u3068\u601d\u3063\u3066\u8003\u3048\u3066\u307e\u3059\u304c\u3001\u3044\u308d\u3093\u306a\u3053\u3068\u3084\u3063\u3066\u308b\u305b\u3044\u3067\u3061\u3063\u3068\u3082\u9032\u3093\u3067\u306a\u3044\u3067\u3059\u3002</p>\n<h3>\u30ed\u30b0\u53ef\u8996\u5316\u30c4\u30fc\u30eb\u306e\u958b\u767a</h3>\n<p>\u30d5\u30a1\u30b9\u30c8\u30d5\u30a9\u30ec\u30f3\u30b8\u30c3\u30af\u7528\u30c4\u30fc\u30eb\u306e\u958b\u767a\u306b\u3042\u305f\u3063\u3066\u3001\u30ed\u30b0\u3092\u8996\u899a\u7684\u306b\u308f\u304b\u308a\u3084\u3059\u304f\u8868\u793a\u3057\u305f\u3044\u306e\u3067 <a href=\"https://d3js.org/\">d3.js</a> \u3042\u305f\u308a\u3067\u4f5c\u308d\u3046\u304b\u306a\u3068\u601d\u3063\u3066\u307e\u3059\u3002\n\u30a4\u30e1\u30fc\u30b8\u3068\u3057\u3066\u306f <a href=\"https://mermaid-js.github.io/mermaid/#/\">mermaid.js</a> \u3063\u307d\u3044\u3084\u3064\u3092\u3002</p>\n<h3>\u30de\u30eb\u30a6\u30a7\u30a2\u89e3\u6790/\u30a4\u30f3\u30b7\u30c7\u30f3\u30c8\u5206\u6790\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306e\u69cb\u7bc9</h3>\n<p>\u6a21\u64ec\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3063\u307d\u3044\u3082\u306e\u3092\u4f5c\u3063\u3066\u3001\u305d\u306e\u4e0a\u3067\u60aa\u3044\u30d7\u30ed\u30b0\u30e9\u30e0\u3068\u304b\u6319\u52d5\u3092\u5206\u6790\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u305f\u3044\u306a\u3068\u8003\u3048\u3066\u307e\u3059\u3002<br />\n\u30b5\u30f3\u30c9\u30dc\u30c3\u30af\u30b9\u306e\u8907\u6570\u74b0\u5883\u7248\u7684\u306a\u3002</p>\n<p><a href=\"https://automatedlab.org/en/latest/\">AutomatedLab</a> \u4f7f\u3044\u305f\u3044\u304b\u3089\u3068\u3044\u3046\u6c17\u6301\u3061\u304c\u5f37\u3044\u3067\u3059\u3002  </p>\n<p>\u3068\u308a\u3042\u3048\u305a<a href=\"https://sumeshi.github.io/posts/ideas/homebuilt-pc-2022-05\">\u57fa\u76e4\u3068\u3057\u3066\u4f7f\u3046\u4e88\u5b9a\u306e\u30b5\u30fc\u30d0\u306f\u7d44\u307f\u307e\u3057\u305f</a>\u3002<br />\n\u2191 \u7d50\u5c40\u672c\u6765\u306e\u7528\u9014\u3058\u3083\u306a\u304f\u3066 ARK Survival Evolved \u306e\u30b5\u30fc\u30d0\u7acb\u3066\u3066\u53cb\u4eba\u3068\u904a\u3093\u3067\u307e\u3059\u3002<br />\n\u30ea\u30bd\u30fc\u30b9\u3082\u307b\u307c\u5168\u90e8\u4f7f\u3044\u5207\u3063\u3066\u308b\u3002\u30e1\u30e2\u30ea\u8cb7\u3044\u8db3\u305d\u3046\u304b\u306a\u3002\u3002</p>\n<h3>NAS\u306e\u304a\u6383\u9664\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u958b\u767a</h3>\n<p>\u4e00\u5fdc\u5bb6\u306bNAS\u304c\u3042\u308b\u3093\u3067\u3059\u304c\u3001\u4eca\u306e\u6240\u30c7\u30fc\u30bf\u306e\u653e\u308a\u8fbc\u307f\u5148\u3050\u3089\u3044\u306b\u3057\u304b\u6d3b\u7528\u3067\u304d\u3066\u307e\u305b\u3093\u3002<br />\n\u6700\u8fd1\u306e\u3084\u3064\u3060\u3068Docker\u3067\u30b3\u30f3\u30c6\u30ca\u3068\u304b\u7acb\u3066\u3089\u308c\u308b\u3089\u3057\u3044\u3051\u3069\u3001\u305d\u3093\u306a\u306b\u9ad8\u6027\u80fd\u3067\u3082\u306a\u3044\u306e\u3067\u3069\u3046\u3057\u3088\u3046\u304b\u306a\u3041\u3063\u3066\u8003\u3048\u3066\u307e\u3059\u3002</p>\n<p>\u5927\u91cf\u306b\u4fdd\u5b58\u3057\u3066\u308b\u5199\u771f\u3068\u304b\u52d5\u753b\u3068\u304b\u97f3\u697d\u3068\u304b\u4e00\u6642\u7684\u306b\u30ed\u30fc\u30ab\u30eb\u306b\u4fdd\u5b58\u3057\u305f\u8ad6\u6587\u306ePDF\u3068\u304b\u7121\u6599\u914d\u5e03\u3055\u308c\u3066\u305f\u672c\u3068\u304b\u305f\u304f\u3055\u3093\u3042\u308b\u306e\u3067\u59cb\u672b\u306b\u8ca0\u3048\u307e\u305b\u3093\u3002<br />\n\u4f55\u304c\u5165\u3063\u3066\u308b\u304b\u308f\u304b\u3093\u306a\u3044\u72b6\u614b\u3067\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u306b\u51fa\u3059\u306e\u306f\u6016\u3044\u306e\u3067\u3001\u30ed\u30fc\u30ab\u30eb\u306bGitLab\u3067\u3082\u7acb\u3066\u3066\u30c7\u30fc\u30bf\u6574\u7406\u7528\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u7ba1\u7406\u3068CI\u306b\u3088\u308b\u5b9f\u884c\u3068\u304b\u3057\u3088\u3046\u304b\u306a\u3063\u3066\u8003\u3048\u3066\u307e\u3059\u3002  </p>\n<p>Gitea\u3068Drone\u306e\u7d44\u307f\u5408\u308f\u305b\u304c\u30ca\u30a6\u3067\u30e4\u30f3\u30b0\u306a\u611f\u3058\u3089\u3057\u3044\u306e\u3067\u3001\u305d\u3063\u3061\u306b\u3059\u308b\u304b\u3082\u3002go\u8a00\u8a9e\u88fd\u3067\u8efd\u3044\u3057\u3002<br />\n\u4e00\u4eba\u3067\u4f7f\u3046\u306b\u306fGitLab\u306f\u30aa\u30fc\u30d0\u30fc\u30b9\u30da\u30c3\u30af\u3059\u304e\u308b\u306e\u3082\u3042\u308a\u307e\u3059\u3057\u306d\u3002</p>\n<h2>\u3084\u308a\u305f\u3044\u3053\u3068</h2>\n<p>\u8272\u3005\u3042\u308b\u3051\u3069\u3001\u6700\u8fd1Python\u3070\u3063\u304b\u66f8\u3044\u3066\u3066\u3064\u307e\u3089\u306a\u3044\u306e\u3067Rust\u3068\u304b\u3067\u30ac\u30c3\u30c4\u30ea\u958b\u767a\u3057\u305f\u3044\u3068\u8003\u3048\u3066\u307e\u3059\u3002\n\u3042\u3068\u3001\u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u3068\u304b\u306e\u30b3\u30df\u30e5\u30cb\u30c6\u30a3\u7684\u306a\u3082\u306e\u306b\u306f\u5c5e\u3057\u3066\u306a\u3044\u3093\u3067\u3059\u304c\u3001\u4e00\u7dd2\u306b\u958b\u767a\u3067\u304d\u308b\u30e1\u30f3\u30d0\u30fc\u3067\u3082\u63a2\u305d\u3046\u304b\u306a\u3068\u601d\u3063\u3066\u307e\u3059\u3002\u30e2\u30c1\u30d9\u9ad8\u3081\u306e\u4eba\u3067\u3002</p>\n<p>\u3060\u3044\u305f\u3044\u305d\u3093\u306a\u611f\u3058\u3067\u3059\u3002</p>", "published_at": "2023-02-21"}