{"title": "future-plans", "heading": "\u4eca\u5f8c\u306e\u65b9\u91dd", "path": "ideas/future-plans", "html_text": "<h1>\u4eca\u5f8c\u306e\u65b9\u91dd</h1>\n<p>\u4eca\u5f8c\u3084\u308a\u305f\u3044\u3053\u3068\u3068\u304b\u3002\u968f\u6642\u66f4\u65b0</p>\n<h2>\u3053\u306e\u30b5\u30a4\u30c8\u306b\u3064\u3044\u3066</h2>\n<p>\u96d1\u591a\u306b\u8272\u3005\u60c5\u5831\u3092\u30e1\u30e2\u3057\u3066\u3044\u3053\u3046\u304b\u306a\u3068\u601d\u3063\u3066\u3044\u307e\u3059\u3002<br />\nQiita\u3068\u304bZenn\u3068\u304bNote\u3068\u304b\u3042\u3093\u307e\u3057\u808c\u306b\u5408\u308f\u306a\u304b\u3063\u305f\u306e\u3067\u3042\u308b\u7a0b\u5ea6\u60c5\u5831\u304c\u6e9c\u307e\u3063\u305f\u3089 <a href=\"https://dev.to/sumeshi\">dev.to</a> \u306b\u3067\u3082\u516c\u958b\u3057\u3088\u3063\u304b\u306a\u3002\u82f1\u8a9e\u306e\u52c9\u5f37\u3082\u517c\u306d\u3066\u3002</p>\n<p>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u95a2\u9023\u306e\u81ea\u5206\u7528\u30e1\u30e2\u3068\u304b\u3001\u8da3\u5473\u958b\u767a\u306b\u3064\u3044\u3066\u306e\u30e1\u30e2\u3092\u66f8\u3044\u3066\u3044\u304f\u4e88\u5b9a\u3067\u3059\u3002<br />\n\u3053\u306e\u30b5\u30a4\u30c8\u81ea\u4f53\u304c\u81ea\u5206\u306e\u4f5c\u3063\u305f\u30c4\u30fc\u30eb\u306e\u5b9f\u9a13\u5834\u306a\u306e\u3067\u3001\u305d\u306e\u3046\u3061\u30d6\u30e9\u30c3\u30b7\u30e5\u30a2\u30c3\u30d7\u3057\u3066\u516c\u958b\u3067\u304d\u305f\u3089\u5b09\u3057\u3044\u304b\u306a\u3002\u4eca\u306e\u3068\u3053 <a href=\"https://sumeshi.github.io/posts/md2api\">md2api</a> \u304f\u3089\u3044\u3057\u304b\u307e\u3068\u3082\u306a\u30c4\u30fc\u30eb\u306a\u3044\u3051\u3069\u3002</p>\n<h2>\u4eca\u53d6\u308a\u7d44\u3093\u3067\u308b\u3053\u3068</h2>\n<h3><a href=\"https://sumeshi.github.io\">sumeshi.github.io</a> \u306e\u958b\u767a</h3>\n<p>\u3061\u307e\u3061\u307e\u4f5c\u3063\u3066\u308b\u3051\u3069\u3042\u3093\u307e\u308a\u9032\u3093\u3067\u306a\u3044\u304b\u3082\u3002\n\u4eca\u5f8c\u306f\u81ea\u7136\u8a00\u8a9e\u51e6\u7406\u306e</p>\n<h3>\u516c\u958b\u3057\u3066\u308b\u30c4\u30fc\u30eb\u7fa4\u306e\u30e1\u30f3\u30c6</h3>\n<h3>\u30ed\u30b0\u53ef\u8996\u5316\u30c4\u30fc\u30eb\u306e\u958b\u767a</h3>\n<h3>\u7c21\u6613\u5168\u6587\u691c\u7d22\u30a8\u30f3\u30b8\u30f3\u306e\u958b\u767a</h3>\n<p>Elasticsearch\u306e\u7c21\u6613\u7248\u7684\u306a\u3002</p>\n<p>\u3082\u3068\u3082\u3068\u5b66\u90e8\u751f\u306e\u3068\u304d\u306b\u81ea\u7136\u8a00\u8a9e\u51e6\u7406\u3068\u304b\u3084\u3063\u3066\u305f\u3053\u3068\u3082\u3042\u3063\u3066\u3001<br />\n\u591a\u5c11\u30ce\u30a6\u30cf\u30a6\u304c\u3042\u308b\u306e\u3067\u3084\u3063\u3066\u307f\u3088\u3063\u304b\u306a\u3063\u3066\u611f\u3058\u3067\u3059\u3002</p>\n<p><a href=\"https://sumeshi.github.io\">sumeshi.github.io</a> \u306e\u691c\u7d22\u6a5f\u80fd\u3092\u5b9f\u73fe\u3059\u308b\u3064\u3044\u3067\u306b\u6a5f\u80fd\u81ea\u4f53\u3092\u72ec\u7acb\u3055\u305b\u3066\u30e9\u30a4\u30d6\u30e9\u30ea\u306b\u3057\u3061\u3083\u304a\u3063\u3066\u601d\u3063\u3066\u307e\u3059\u3002</p>\n<h3>\u30d5\u30a1\u30b9\u30c8\u30d5\u30a9\u30ec\u30f3\u30b8\u30c3\u30af\u7528\u30c4\u30fc\u30eb\u306e\u958b\u767a</h3>\n<p><a href=\"https://github.com/sumeshi\">GitHub</a> \u3067\u516c\u958b\u3057\u3066\u308b\u30c4\u30fc\u30eb\u7fa4\u306e\u6a5f\u80fd\u3092\u7d71\u5408\u3057\u3066\u53ef\u8996\u5316\u307e\u3067\u3084\u3063\u3066\u304f\u308c\u308b\u3088\u3046\u306a\u611f\u3058\u306e\u3092\u8003\u3048\u3066\u307e\u3059\u3002\n\u5927\u5b66\u9662\u306e\u3068\u304d\u306b\u3084\u3063\u3066\u305f\u7814\u7a76\u3092\u500b\u4eba\u306e\u8da3\u5473\u3068\u3057\u3066\u5b8c\u6210\u3055\u305b\u3066\u307f\u305f\u3044\u306a\u3068\u601d\u3063\u3066\u8003\u3048\u3066\u307e\u3059\u304c\u3001\u3044\u308d\u3093\u306a\u3053\u3068\u3084\u3063\u3066\u308b\u305b\u3044\u3067\u3061\u3063\u3068\u3082\u9032\u3093\u3067\u306a\u3044\u3067\u3059\u3002</p>\n<h3>\u30de\u30eb\u30a6\u30a7\u30a2\u89e3\u6790/\u30a4\u30f3\u30b7\u30c7\u30f3\u30c8\u5206\u6790\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306e\u69cb\u7bc9</h3>\n<p>\u6a21\u64ec\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3063\u307d\u3044\u3082\u306e\u3092\u4f5c\u3063\u3066\u3001\u305d\u306e\u4e0a\u3067\u60aa\u6027\u306e\u52d5\u4f5c\u3092\u5206\u6790\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u305f\u3044\u306a\u3068\u8003\u3048\u3066\u307e\u3059\u3002<br />\n\u30b5\u30f3\u30c9\u30dc\u30c3\u30af\u30b9\u306e\u8907\u6570\u74b0\u5883\u7248\u7684\u306a\u3002</p>\n<h2>\u3084\u308a\u305f\u3044\u3053\u3068</h2>\n<p>\u8272\u3005\u3042\u308b\u3051\u3069\u3001\u6700\u8fd1Python\u3070\u3063\u304b\u66f8\u3044\u3066\u3066\u3064\u307e\u3089\u306a\u3044\u306e\u3067Rust\u3068\u304b\u3067\u30ac\u30c3\u30c4\u30ea\u958b\u767a\u3057\u305f\u3044\u3068\u8003\u3048\u3066\u307e\u3059\u3002\n\u3042\u3068\u3001\u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u3068\u304b\u306e\u30b3\u30df\u30e5\u30cb\u30c6\u30a3\u7684\u306a\u3082\u306e\u306b\u306f\u5c5e\u3057\u3066\u306a\u3044\u3093\u3067\u3059\u304c\u3001\u4e00\u7dd2\u306b\u958b\u767a\u3067\u304d\u308b\u30e1\u30f3\u30d0\u30fc\u3067\u3082\u63a2\u305d\u3046\u304b\u306a\u3068\u601d\u3063\u3066\u307e\u3059\u3002\u30e2\u30c1\u30d9\u9ad8\u3081\u306e\u4eba\u3067\u3002</p>\n<p>\u3060\u3044\u305f\u3044\u305d\u3093\u306a\u611f\u3058\u3067\u3059\u3002</p>", "published_at": "2022-05-20T14:57:10"}