{"title": "anonymity-assurance", "heading": "\u533f\u540d\u6027\u306e\u62c5\u4fdd", "path": "knowledges/anonymity-assurance", "html_text": "<h1>\u533f\u540d\u6027\u306e\u62c5\u4fdd</h1>\n<p>web\u4e0a\u3067\u81ea\u8eab\u306e\u533f\u540d\u6027\u3092\u62c5\u4fdd\u3059\u308b\u305f\u3081\u306b\u3059\u3079\u304d\u3053\u3068\u3001Tor\u3068\u304b\u3002</p>\n<h2>\u6982\u8981</h2>\n<p>\u96fb\u5b50\u7684\u60c5\u5831\u306e\u3084\u308a\u3068\u308a\u306f\u3001\u7121\u6570\u306e\u75d5\u8de1\u3092\u6b8b\u3059\u3002<br />\n\u305d\u308c\u3089\u3092\u5b8c\u5168\u306b\u6d88\u3059\u3053\u3068\u306f\u56f0\u96e3\u3067\u3042\u308a\u3001\u305f\u3063\u305f\u4e00\u5ea6\u306e\u30df\u30b9\u304b\u3089\u8eab\u5143\u304c\u5272\u308c\u308b\u3053\u3068\u3082\u73cd\u3057\u304f\u306a\u3044\u3002</p>\n<p>\u672c\u8a18\u4e8b\u3067\u306f\u3001\u81ea\u8eab\u306e\u533f\u540d\u6027\u3092\u62c5\u4fdd\u3059\u308b\u305f\u3081\u306b\u3059\u3079\u304d\u3053\u3068\u30fb\u8003\u3048\u308b\u3079\u304d\u3053\u3068\u306b\u3064\u3044\u3066\u8ff0\u3079\u308b\u3002<br />\n\u307e\u305f\u3001\u3053\u308c\u3089\u306f\u8a00\u8ad6\u306e\u81ea\u7531\u30fb\u81ea\u8eab\u306e\u5b89\u5168\u3092\u78ba\u4fdd\u3059\u308b\u305f\u3081\u306e\u60c5\u5831\u3067\u3042\u308b\u3002\u60aa\u7528\u30c0\u30e1\u30fb\u7d76\u5bfe\u3002</p>\n<h2>\u74b0\u5883</h2>\n<h3>OS</h3>\n<h4><a href=\"https://tails.boum.org/\">Tails</a></h4>\n<p>Debian\u30d9\u30fc\u30b9\u306eLinux\u30c7\u30a3\u30b9\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3002<br />\n\u4e0b\u8a18\u306e\u7406\u7531\u3067\u30aa\u30b9\u30b9\u30e1\u3002</p>\n<ul>\n<li>OS\u304b\u3089\u306e\u901a\u4fe1\u306f\u5168\u3066tor\u3092\u7d4c\u7531\u3059\u308b</li>\n<li>\u30c7\u30a3\u30b9\u30af\u4e0a\u306b\u4e00\u5207\u306e\u60c5\u5831\u3092\u4fdd\u5b58\u305b\u305a\u3001\u30b7\u30b9\u30c6\u30e0\u7d42\u4e86\u5f8c\u306b\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u306f\u524a\u9664\u3055\u308c\u308b</li>\n</ul>\n<p>\u3053\u308c\u3060\u3051\u3067\u3082\u3042\u308b\u7a0b\u5ea6\u306e\u533f\u540d\u6027\u3092\u78ba\u4fdd\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u3002<br />\n\u79c1\u306f\u30e9\u30f3\u30b5\u30e0\u30a6\u30a7\u30a2\u30b0\u30eb\u30fc\u30d7\u306a\u3069\u306e\u60c5\u5831\u3092\u96c6\u3081\u308b\u969b\u3001\u5b89\u5168\u6027\u304c\u78ba\u8a8d\u3055\u308c\u3066\u3044\u306a\u3044\u30b5\u30a4\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u5834\u5408\u304c\u3042\u308b\u306e\u3067\u3053\u3046\u3044\u3046\u306e\u3092\u4f7f\u3063\u305f\u308a\u3057\u3066\u3044\u308b\u3002</p>\n<p>\u3042\u3068\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308bTor\u30d6\u30e9\u30a6\u30b6\u306f\u3042\u3093\u307e\u308a\u5b89\u5168\u306a\u8a2d\u5b9a\u306b\u306a\u3063\u3066\u3044\u306a\u3044\u306e\u3067\u6ce8\u610f\u3002<br />\nJavascript\u306f\u30aa\u30d5\u306b\u3057\u3068\u3044\u305f\u307b\u3046\u304c\u3044\u3044\u3057\u3001\u4ed6\u306b\u3082\u8a2d\u5b9a\u3092\u898b\u76f4\u3059\u3068\u5409\u3002</p>\n<h4><a href=\"https://www.whonix.org/\">Whonix</a></h4>\n<p>\u3053\u3061\u3089\u3082Debian\u30d9\u30fc\u30b9\u306eLinux\u30c7\u30a3\u30b9\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3002<br />\n\u901a\u4fe1\u306e\u969b\u306b Whonix-Gateway \u3092\u7d4c\u7531\u3055\u305b\u308b\u3053\u3068\u3067\u3001\u3059\u3079\u3066\u306e\u901a\u4fe1\u3092Tor\u7d4c\u7531\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u3002</p>\n<h3>VPN</h3>\n<p>Tor\u3060\u3051\u3067\u306f\u533f\u540d\u6027\u306e\u62c5\u4fdd\u304c\u4e0d\u5341\u5206\u306a\u5834\u5408\u304c\u3042\u308b\u3002<br />\n\u3068\u3044\u3046\u304b\u3001\u3069\u3053\u306e\u8ab0\u304c\u7acb\u3066\u305f\u306e\u304b\u3082\u308f\u304b\u3089\u3093\u30b5\u30fc\u30d0(\u60aa\u610f\u306e\u3042\u308b\u30e6\u30fc\u30b6\u3060\u3063\u305f\u308a\u3001NSA\u306a\u3069\u306e\u7d44\u7e54\u306e\u5236\u5fa1\u4e0b\u306b\u3042\u308b\u5834\u5408\u304c\u3042\u308b)\u3092\u4fe1\u7528\u3057\u3066\u306f\u3044\u3051\u306a\u3044\u3002  </p>\n<p>VPN\u3092\u4f7f\u3046\u5834\u5408\u3001Tor over VPN \u3068 VPN over Tor \u3068\u547c\u3070\u308c\u308b2\u3064\u306e\u624b\u6cd5\u304c\u3042\u308b\u3002<br />\n\u6587\u5b57\u901a\u308a\u306a\u306e\u3067\u7279\u306b\u8aac\u660e\u306f\u3057\u306a\u3044\u304c\u3001\u898b\u3048\u308b\u7bc4\u56f2\u304c\u5909\u308f\u3063\u3066\u304f\u308b\u306e\u3067\u6ce8\u610f\u3002</p>\n<p>\u307e\u305f\u3001VPN\u3092\u4f7f\u7528\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u81ea\u8eab\u306e\u5951\u7d04\u3057\u3066\u3044\u308bISP\u306f\u3001\u3042\u306a\u305f\u304cTor\u3092\u4f7f\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3067\u304d\u308b\u3068\u3044\u3046\u3053\u3068\u306b\u3082\u6ce8\u610f\u3002</p>\n<h3>\u7269\u7406\u7684\u74b0\u5883</h3>\n<p>\u7269\u7406\u7684\u74b0\u5883\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3092\u78ba\u4fdd\u3059\u308b\u3053\u3068\u3082\u5fd8\u308c\u305a\u306b\u3002\u3068\u3044\u3046\u304b\u3053\u308c\u304c\u4e00\u756a\u96e3\u3057\u304f\u3066\u91cd\u8981\u3002  </p>\n<h4>\u6a5f\u5668</h4>\n<p>\u9ad8\u3051\u308c\u3070\u826f\u3044\u3068\u3044\u3046\u308f\u3051\u3067\u306f\u306a\u3044\u3051\u3069\u3001\u5b89\u304b\u308d\u3046\u60aa\u304b\u308d\u3046\u306f\u3060\u3044\u305f\u3044\u305d\u3046\u306a\u306e\u3067\u3001\u5909\u306a\u30c7\u30d0\u30a4\u30b9\u3092\u4f7f\u308f\u306a\u3044\u3002\n\u30ac\u30b8\u30a7\u30aa\u30bf\u306e\u4eba\u306fHuawei\u3068\u304bXiaomi\u3068\u304b\u6709\u96e3\u304c\u3063\u3066\u4f7f\u3063\u3066\u308b\u306e\u3088\u304f\u898b\u308b\u3051\u3069\u3001\u30ea\u30c8\u30a2\u30cb\u30a2\u653f\u5e9c\u306e\u8abf\u67fb\u306b\u3088\u3063\u3066\u691c\u95b2\u6a5f\u80fd\u306e\u642d\u8f09\u304c\u5831\u544a\u3055\u308c\u305f\u3053\u3068\u3082\u3042\u308b\u3002</p>\n<p><a href=\"https://www.nksc.lt/doc/en/analysis/2021-08-23_5G-CN-analysis_env3.pdf\">Assessment of cybersecurity of mobile devices supporting 5G technology sold in Lithuania</a></p>\n<p>\u3053\u308c\u3092\u898b\u3066\u4e2d\u56fd\u306f\u60aa\uff01Apple\u6700\u9ad8\uff01\u3068\u306a\u308b\u306e\u306f\u9055\u3046\u3068\u601d\u3046\u3051\u3069\u3001\u3084\u3063\u3066\u308b\u56fd\u306f\u30de\u30b8\u3067\u3084\u3063\u3066\u308b\u306e\u3067\u6c17\u3092\u3064\u3051\u308b\u3053\u3068\u3002</p>\n<h4>\u7a3c\u50cd\u72b6\u614b\u306eOS</h4>\n<p>Tails\u3092\u4f7f\u3063\u3066\u3044\u305f\u3068\u3057\u3066\u3082\u3001\u8d77\u52d5\u4e2d\u306f\u30e1\u30e2\u30ea\u4e0a\u306b\u60c5\u5831\u304c\u6b8b\u3063\u3066\u3044\u308b\u3002<br />\n\u307e\u308b\u3054\u3068\u30c0\u30f3\u30d7\u3057\u3066\u4e2d\u8eab\u3092\u8997\u3051\u3070\u3044\u304f\u3089\u3067\u3082\u60c5\u5831\u306f\u5f97\u3089\u308c\u308b\u306f\u305a\u3002</p>\n<h4>\u6d3b\u52d5\u6642\u9593\u5e2f</h4>\n<p>web\u3078\u306e\u66f8\u304d\u8fbc\u307f\u3092\u3057\u305f\u6642\u9593\u3001\u983b\u5ea6\u306a\u3069\u304b\u3089\u81ea\u5206\u306e\u5e74\u9f62\u3092\u7d5e\u3089\u305b\u306a\u3044\u3002<br />\n\u8d77\u304d\u3066\u3044\u308b\u6642\u9593\u3001\u50cd\u3044\u3066\u3044\u308b\u6642\u9593\u3001\u6027\u5225\u3001\u5e74\u9f62\u3001\u3042\u3089\u3086\u308b\u60c5\u5831\u306e\u63a8\u6e2c\u3092\u96e3\u3057\u304f\u3059\u308b\u3002</p>\n<h4>\u901a\u4fe1\u74b0\u5883</h4>\n<p>\u81ea\u5b85\u306e\u56de\u7dda\u304b\u3089\u3064\u306a\u3052\u3066\u3044\u308b\u5834\u5408\u3001IP\u30a2\u30c9\u30ec\u30b9\u3084\u901a\u4fe1\u901f\u5ea6\u306a\u3069\u304b\u3089\u60c5\u5831\u304c\u5f97\u3089\u308c\u308b\u3053\u3068\u3082\u3042\u308b\u3002<br />\n\u76e3\u8996\u30ab\u30e1\u30e9\u306e\u6709\u7121\u306b\u3082\u6ce8\u610f\u3057\u306a\u304c\u3089\u8857\u4e2d\u306e\u30d5\u30ea\u30fcWi-Fi\u3092\u4f7f\u3046\u306e\u304c\u826f\u3044\u304b\u3082\u3057\u308c\u306a\u3044\u3002\u3053\u3093\u306a\u3053\u3068\u3084\u3063\u3066\u308b\u306e\u30e4\u30d0\u3044\u3053\u3068\u3084\u3063\u3066\u308b\u4eba\u3050\u3089\u3044\u3057\u304b\u3044\u306a\u305d\u3046\u3060\u3051\u3069\u3002</p>\n<h3>\u30c4\u30fc\u30eb</h3>\n<h4><a href=\"https://telegram.org\">Telegram</a></h4>\n<p>\u533f\u540d\u30e1\u30c3\u30bb\u30f3\u30b8\u30e3\u30fc\u30a2\u30d7\u30ea\u306e\u4ee3\u8868\u683c\u3002<br />\n\u4f7f\u3063\u3066\u306a\u3044\u3051\u3069\u3053\u308c\u3082\u3069\u3046\u306a\u3093\u3060\u308d\u3046\u3002\u30ed\u30b7\u30a2\u3060\u3057\u3002</p>\n<p>\u6a5f\u80fd\u306f\u8c4a\u5bcc\u3060\u3051\u3069\u3001\u5b89\u5168\u6027\u306f\u5f8c\u8ff0\u306eSignal\u306e\u304c\u30de\u30b7\u3002</p>\n<h4><a href=\"https://signal.org\">Signal</a></h4>\n<p>e2e\u6697\u53f7\u5316\u306a\u306e\u3067Telegram\u3088\u308a\u5b89\u5fc3\u3002<br />\n\u305f\u3060API\u304c\u4f7f\u3044\u3065\u3089\u305d\u3046\u3001\u30e6\u30fc\u30b6\u3082\u5c11\u306a\u3044\u3057\u4e00\u9577\u4e00\u77ed\u3002</p>\n<h4><a href=\"https://protonmail.com\">Protonmail</a></h4>\n<p>\u5b89\u5168\u304b\u3063\u3066\u8a00\u308f\u308c\u308b\u3068\u5fae\u5999\u3002IP\u4fdd\u6301\u3057\u307e\u305b\u3093\u3068\u304b\u8a00\u3063\u3068\u3044\u3066\u4fdd\u6301\u3057\u3066\u305f\u3053\u3068\u3082\u3042\u3063\u305f\u3057\u3001\u306a\u3093\u306a\u3089\u5f53\u5c40\u306b\u30c7\u30fc\u30bf\u6e21\u3057\u3066\u305f\u3002<br />\n\u3067\u3082Gmail\u3088\u308a\u306f\u30de\u30b7\u3067\u3057\u3087\u3002\u591a\u5206\u3002</p>\n<p><a href=\"https://gigazine.net/news/20210908-protonmail-ip-address-privacy-policy/\">\u5fb9\u5e95\u3057\u305f\u30d7\u30e9\u30a4\u30d0\u30b7\u30fc\u4fdd\u8b77\u304c\u58f2\u308a\u306eProtonMail\u304c\u300cIP\u30ed\u30b0\u3092\u4fdd\u6301\u3057\u306a\u3044\u300d\u3068\u3044\u3046\u6587\u7ae0\u3092\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u304b\u3089\u524a\u9664</a></p>\n<h4><a href=\"https://10minemail.com\">10minutes mail</a></h4>\n<p>10\u5206\u9593\u3060\u3051\u6709\u52b9\u306a\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u3092\u767a\u884c\u3057\u3066\u304f\u308c\u308b\u3002<br />\n\u5b89\u5168\u304b\u3068\u8a00\u308f\u308c\u308b\u3068\u5fae\u5999\u3060\u3051\u3069\u3001\u3088\u304f\u308f\u304b\u3089\u3093\u30b5\u30fc\u30d3\u30b9\u306e\u305f\u3081\u306b\u672c\u30a2\u30ab\u4f7f\u3044\u305f\u304f\u306a\u3044\u3068\u304d\u3082\u3042\u308b\u3088\u306d\u3002</p>\n<p>\u3061\u306a\u307f\u306b\u3001SMS\u8a8d\u8a3c\u306e\u305f\u3081\u306b\u30d5\u30ea\u30fc\u306e\u96fb\u8a71\u756a\u53f7\u3092\u516c\u958b\u3057\u3066\u308b\u30b5\u30fc\u30d3\u30b9\u3082\u3042\u3063\u305f\u308a\u3059\u308b\u3002<br />\n\u5927\u62b5\u3046\u307e\u304f\u3044\u304b\u306a\u3044\u306e\u3067\u3042\u3093\u307e\u308a\u671f\u5f85\u3057\u306a\u3044\u3088\u3046\u306b\u3002</p>\n<h4><a href=\"https://www.inetsim.org/\">INetSim</a></h4>\n<p>DNS, HTTP, SMTP\u306a\u3069\u8272\u3005\u306a\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u901a\u4fe1\u5148\u3068\u3057\u3066\u632f\u308b\u821e\u3063\u3066\u304f\u308c\u308b\u3002<br />\n\u672c\u6765\u306f\u30de\u30eb\u30a6\u30a7\u30a2\u89e3\u6790\u7528\u3067\u3001\u5909\u306a\u901a\u4fe1\u3092\u5916\u90e8\u306b\u51fa\u3055\u306a\u3044\u305f\u3081\u306e\u3082\u306e\u306a\u3093\u3060\u3051\u3069\u3001\u3053\u3046\u3044\u3046\u3053\u3068\u306b\u3082\u4f7f\u3048\u308b\u304b\u3082\u306d\u3002</p>\n<h2>\u7d42\u308f\u308a\u306b</h2>\n<p>\u65e5\u672c\u3067\u306f\u4eca\u306e\u6240\u56fd\u5bb6\u304c\u7a4d\u6975\u7684\u306b\u60c5\u5831\u7d71\u5236\u3092\u884c\u3063\u305f\u308a\u3059\u308b\u3053\u3068\u306f\u306a\u3044\u3051\u3069\u3001\u4ed6\u306e\u56fd\u3060\u3068\u5f53\u7136\u306e\u3088\u3046\u306b\u3057\u3066\u3044\u305f\u308a\u3059\u308b\u3002<br />\n\u3053\u308c\u304b\u3089\u5148\u305d\u3046\u306a\u3089\u306a\u3044\u3068\u3082\u9650\u3089\u306a\u3044\u306e\u3067\u3001\u81ea\u5206\u306e\u8eab\u306f\u81ea\u5206\u3067\u5b88\u308c\u308b\u7a0b\u5ea6\u306b\u77e5\u8b58\u3092\u3064\u3051\u3066\u304a\u304f\u3068\u826f\u3044\u306e\u304b\u3082\u3057\u308c\u306a\u3044\u3002</p>\n<p><a href=\"https://sumeshi.github.io/posts/md2api\">md2api</a> \u30c6\u30b9\u30c8\u306e\u305f\u3081\u306b\u66f8\u3044\u305f\u8a18\u4e8b\u306a\u306e\u3067\u3044\u307e\u306e\u3068\u3053\u308d\u3042\u3093\u307e\u308a\u4e2d\u8eab\u306f\u306a\u3044\u3002 \u968f\u6642\u8ffd\u8a18\u4e88\u5b9a</p>", "published_at": "2022-04-29T17:20:32"}