{"title": "helpful-websites", "heading": "\u6709\u7528\u306aWeb\u30b5\u30a4\u30c8", "path": "knowledges/helpful-websites", "html_text": "<h1>\u6709\u7528\u306aWeb\u30b5\u30a4\u30c8</h1>\n<p>\u3088\u304f\u4f7f\u3046\u3084\u3064\u306e\u30e1\u30e2, \u5b89\u5168\u6027\u3092\u4fdd\u8a3c\u3059\u308b\u3082\u306e\u3067\u306f\u306a\u3044\u3067\u3059.</p>\n<h2>Google Input Tools</h2>\n<p>\u30d6\u30e9\u30a6\u30b6\u3067\u4f7f\u3048\u308bIME.<br />\n\u57fa\u672c\u7684\u306bVM\u4f7f\u3046\u6642\u306e\u8a00\u8a9e\u8a2d\u5b9a\u306f\u82f1\u8a9e\u306b\u3057\u3066\u308b\u3093\u3060\u3051\u3069\u3001\u308f\u3056\u308f\u3056IME\u5165\u308c\u308b\u307b\u3069\u3058\u3083\u306a\u3044\u3051\u3069\u65e5\u672c\u8a9e\u304c\u5fc5\u8981\u306a\u3068\u304d\u306b\u4f7f\u3063\u3066\u307e\u3059\u3002</p>\n<p>https://www.google.com/inputtools/try/</p>\n<h2>CyberChef</h2>\n<p>\u3044\u308d\u3093\u306a\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u308bEncoding/Decoding\u30c4\u30fc\u30eb\u3067\u3059\u3002<br />\n\u30de\u30eb\u30a6\u30a7\u30a2\u306e\u30b3\u30fc\u30c9\u5185\u306b\u57cb\u3081\u8fbc\u307e\u308c\u305f\u6587\u5b57\u5217\u3084\u3089\u3001\u30a2\u30cb\u30e1\u5185\u3067\u51fa\u3066\u304f\u308bHex\u3084\u3089\u3092\u8aad\u3080\u3068\u304d\u306b\u4f7f\u3044\u307e\u3059\u3002</p>\n<p>\u3061\u306a\u307f\u306b\u30ed\u30fc\u30ab\u30eb\u3067\u5b9f\u884c\u3067\u304d\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3042\u308b\u306e\u3067\u6f0f\u6d29\u3057\u3066\u56f0\u308b\u30c7\u30fc\u30bf\u306e\u3068\u304d\u306f\u305d\u3063\u3061\u3092\u4f7f\u3044\u307e\u3057\u3087\u3046\u3002</p>\n<p>https://gchq.github.io/CyberChef/</p>\n<h2>smash</h2>\n<p>\u6700\u5f37\u306e\u30d5\u30a1\u30a4\u30eb\u30a2\u30c3\u30d7\u30ed\u30fc\u30c0\u30fc\u3067\u3059\u3002  </p>\n<p>Firefox Send\u3082\u540c\u6642\u671f\u4f7f\u3063\u3066\u3066\u30b5\u30a4\u30ba\u30c7\u30ab\u3044\u3057\u30a8\u30a8\u3084\u3093\u3068\u601d\u3063\u3066\u305f\u306e\u306b\u6d88\u3048\u307e\u3057\u305f\u3002<br />\n\u30ae\u30ac\u30d5\u30a1\u30a4\u30eb\u4fbf\u4f7f\u3063\u3066\u308b\u4eba\u591a\u3044\u3051\u3069\u6016\u304f\u306a\u3044\u3067\u3059\u304b\uff1f\u79c1\u306f\u6016\u3044\u3067\u3059\u3002  </p>\n<p>https://fromsmash.com/</p>\n<p>\u95a2\u4fc2\u306a\u3044\u3051\u3069\u3053\u3046\u3044\u3046\u5916\u90e8\u306e\u30a2\u30c3\u30d7\u30ed\u30fc\u30c0\u30fc\u306b\u6295\u3052\u308b\u3068\u304d\u306f\u6697\u53f7\u5316zip\u3068\u304b\u3084\u3081\u307e\u3057\u3087\u3046\u3002\u77ac\u6bba\u3055\u308c\u308b\u306e\u3067\u3002<br />\n\u3084\u308b\u306a\u3089\u305b\u3081\u3066<a href=\"https://www.veracrypt.fr/en/Home.html\">VeraCrypt</a>\u3068\u304b\u4f7f\u3063\u3066\u304f\u3060\u3055\u3044\u3002</p>\n<h2>AHMIA</h2>\n<p>Onion\u30b5\u30a4\u30c8\u306e\u691c\u7d22\u30a8\u30f3\u30b8\u30f3\u3002<br />\n\u7d50\u69cb\u3044\u308d\u3093\u306a\u60c5\u5831\u304c\u51fa\u3066\u304d\u307e\u3059\u3002\u305d\u3093\u306a\u306b\u4f7f\u3044\u3053\u306a\u305b\u3066\u306a\u3044\u306e\u3067\u304a\u3082\u308d\u3044\u60c5\u5831\u304c\u3042\u3063\u305f\u3089\u5171\u6709\u3057\u3066\u304f\u3060\u3055\u3044\u3002</p>\n<p>https://ahmia.fi/</p>\n<h2>Proxy List / Anonymous - \u533f\u540d\u30d7\u30ed\u30ad\u30b7\u30ea\u30b9\u30c8\u30fb\u4e32\u30ea\u30b9\u30c8</h2>\n<p>\u4f7f\u3048\u308b\u533f\u540d\u30d7\u30ed\u30ad\u30b7\u306e\u4e00\u89a7\u3092\u8868\u793a\u304f\u308c\u3066\u308b\u30b5\u30a4\u30c8\u3067\u3059\u3002<br />\n\u3082\u3061\u308d\u3093\u5b89\u5168\u306a\u308f\u3051\u304c\u306a\u3044\u306e\u3067\u3053\u308c\u4ee5\u5916\u306b\u3082\u5bfe\u7b56\u3092\u8b1b\u3058\u3066\u304f\u3060\u3055\u3044\u3002\u30de\u30b8\u3067\u3002  </p>\n<p>Tor\u3067Web\u30a2\u30af\u30bb\u30b9\u3057\u3066\u308b\u3068denylist\u306b\u6307\u5b9a\u3055\u308c\u3066\u308b\u3053\u3068\u304c\u3042\u308b\u306e\u3067\u4f7f\u3063\u305f\u308a\u3057\u3066\u307e\u3059\u3002</p>\n<p>http://www.cybersyndrome.net/pla6.html</p>\n<h2>\u8a3a\u65ad\u304f\u3093</h2>\n<p>\u30d7\u30ed\u30ad\u30b7\u304b\u3069\u3046\u304b\u306e\u5224\u5b9a\u3092\u3057\u3066\u304f\u308c\u307e\u3059\u3002<br />\n\u524d\u8ff0\u306e\u533f\u540d\u30d7\u30ed\u30ad\u30b7\u304c\u3061\u3083\u3093\u3068\u523a\u3055\u3063\u3066\u308b\u304b\u3068\u304b\u308f\u304b\u308a\u3084\u3059\u3044\u3067\u3059\u3002</p>\n<p>http://www.eastvalley.or.jp/cgi/envchk070.cgi</p>\n<h2>\u7d75\u6587\u5b57 \u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u30fc</h2>\n<p>Slack\u3068\u304bDiscord\u3068\u304b\u306e\u30b9\u30bf\u30f3\u30d7\u4f5c\u308c\u308b\u30b5\u30a4\u30c8\u3067\u3059\u3002<br />\n\u30b7\u30f3\u30d7\u30eb\u3067\u3059\u304c\u6700\u5f37\u3067\u3059\u3002  </p>\n<p>https://emoji-gen.ninja/</p>\n<h2>ClickUp</h2>\n<p>\u6700\u5f37\u306e\u9032\u6357\u7ba1\u7406\u30b5\u30fc\u30d3\u30b9\u3067\u3059\u3002</p>\n<p>RedMine\u306b\u8010\u3048\u304b\u306d\u3066Jira\u3068\u304b\u8272\u3005\u4f7f\u3044\u307e\u3057\u305f\u304c\u3053\u308c\u4ee5\u4e0a\u306e\u3082\u306e\u306f\u306a\u3044\u3067\u3059\u3002<br />\n\u6b63\u76f4\u4eca\u306f\u9032\u6357\u7ba1\u7406\u3059\u308b\u3088\u3046\u306a\u3082\u306e\u3082\u306a\u3044\u306e\u3067\u4f7f\u3063\u3066\u306a\u3044\u3051\u3069\u3002</p>\n<p>https://clickup.com/</p>\n<h2>Server.pro</h2>\n<p>\u7121\u6599\u306eMinecraft\u30b5\u30fc\u30d0\u304c\u5efa\u3066\u3089\u308c\u307e\u3059\u3002<br />\n1\u6642\u9593\u306b1\u56deCAPTCHA\u306e\u5165\u529b\u304c\u5fc5\u8981\u3067\u3059\u304c\u3001\u4ed6\u306e\u7121\u6599\u3067\u7acb\u3066\u3089\u308c\u308b\u30b5\u30a4\u30c8\u3068\u6bd4\u8f03\u3057\u3066\u3082\u30ec\u30b9\u30dd\u30f3\u30b9\u7206\u901f\u3067\u3059\u3002  </p>\n<p>https://server.pro/</p>\n<h2>U-NEXT</h2>\n<p>\u30de\u30b8\u6700\u5f37\u3067\u3059\u3002\u7121\u9650\u306b\u6642\u9593\u304c\u6eb6\u3051\u307e\u3059\u3002<br />\n\u3053\u308c\u306e\u4ed6\u306b Amazon Prime, d\u30a2\u30cb\u30e1\u30b9\u30c8\u30a2, Hulu, Netflix(\u4eca\u306f\u89e3\u7d04) \u4f7f\u3063\u3066\u307e\u3059\u304c\u3001<br />\n\u4e00\u756aUI\u304c\u307e\u3068\u3082\u3067\u3059\u3002\u5bb6\u65cf\u30a2\u30ab\u30a6\u30f3\u30c8\u3082\u8907\u6570\u4f5c\u308c\u308b\u306e\u3067\u5b89\u5168\u3002</p>\n<p>https://video.unext.jp/</p>", "published_at": "2023-03-11"}