{"title": "linux-for-security", "heading": "\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u7814\u7a76\u8005\u5411\u3051Linux\u30c7\u30a3\u30b9\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u307e\u3068\u3081", "path": "knowledges/linux-for-security", "html_text": "<h1>\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u7814\u7a76\u8005\u5411\u3051Linux\u30c7\u30a3\u30b9\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u307e\u3068\u3081</h1>\n<p>\u500b\u4eba\u7684\u306b\u3044\u3044\u611f\u3058\u3060\u306a\u3068\u601d\u3063\u305f\u3084\u3064\u3002\u504f\u898b\u3042\u308a\u3002\u4f7f\u3063\u3066\u306a\u3044\u3084\u3064\u3082\u4e00\u5fdc\u30e1\u30e2\u7684\u306b\u3002</p>\n<h2>Kali Linux</h2>\n<p>\u30da\u30cd\u30c8\u30ec\u30fc\u30b7\u30e7\u30f3\u30c6\u30b9\u30c8\u306b\u7279\u5316\u3057\u305fDistribution<br />\n\u524d\u306f\u30c7\u30b9\u30af\u30c8\u30c3\u30d7\u74b0\u5883\u304cGnome\u304b\u306a\u3093\u304b\u3067\u30cf\u30c1\u30e3\u30e1\u30c1\u30e3\u306b\u91cd\u304b\u3063\u305f\u3093\u3067\u3059\u304c\u3001\u4eca\u306f\u304b\u306a\u308a\u3044\u3044\u611f\u3058\u3067\u3059\u3002</p>\n<p>Debian\u30d9\u30fc\u30b9\u306a\u306e\u3067\u5909\u306a\u7656\u3082\u306a\u3044\u3057\u3001\u30da\u30cd\u30c8\u30ec\u76ee\u7684\u3067\u306a\u304f\u3066\u3082\u30c7\u30d5\u30a9\u3067\u3060\u3044\u305f\u3044\u306a\u3093\u3067\u3082\u3067\u304d\u307e\u3059\u3002<br />\n\u3053\u3060\u308f\u308a\u304c\u306a\u3051\u308c\u3070\u3068\u308a\u3042\u3048\u305a\u3053\u308c\u3060\u3051\u4f7f\u3063\u3066\u304a\u3051\u3070\u554f\u984c\u306a\u3044\u3067\u3059\u3002</p>\n<p><a href=\"https://www.kali.org/get-kali/\">https://www.kali.org/get-kali/</a></p>\n<h2>Parrot Security OS</h2>\n<p>Kali\u3068\u540c\u3058\u304f\u30da\u30cd\u30c8\u30ec\u30fc\u30b7\u30e7\u30f3\u30c6\u30b9\u30c8\u306b\u7279\u5316\u3057\u305fDistribution<br />\nKali\u304c\u91cd\u304b\u3063\u305f\u6642\u4ee3\u306f\u3053\u308c\u3092\u30e1\u30a4\u30f3\u306b\u4f7f\u3063\u3066\u307e\u3057\u305f\u3002\u898b\u305f\u76ee\u3082macOS\u3063\u307d\u304f\u3066Good</p>\n<p>\u3053\u3061\u3089\u3082Debian\u30d9\u30fc\u30b9</p>\n<p><a href=\"https://www.parrotsec.org/\">https://www.parrotsec.org/</a></p>\n<h2>Tails</h2>\n<p>\u533f\u540d\u6027\u306b\u91cd\u304d\u3092\u304a\u3044\u305fDistribution</p>\n<p>\u79c1\u306fTor\u63a5\u7d9a\u5c02\u7528\u30de\u30b7\u30f3\u3068\u3057\u3066\u4f7f\u3063\u3066\u3044\u307e\u3059\u3002<br />\n\u57fa\u672c\u7684\u306b\u30e1\u30e2\u30ea\u4e0a\u306b\u3057\u304b\u30c7\u30fc\u30bf\u3092\u4fdd\u7ba1\u305b\u305a\u3001\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u6642\u306b\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u3092\u524a\u9664\u3059\u308b\u5fb9\u5e95\u3076\u308a\u3002\u3059\u3054\u3044\u3002  </p>\n<p>\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u3067\u306f\u305d\u3093\u306a\u306b\u30bb\u30ad\u30e5\u30a2\u306a\u308f\u3051\u3067\u306f\u306a\u3044\u306e\u3067\u3061\u3087\u3063\u3068\u5de5\u592b\u3059\u308b\u5fc5\u8981\u3042\u308a\u3002<br />\n\u60aa\u3044\u3053\u3068\u306f\u30c0\u30e1\u3067\u3059\u3002\u30c0\u30e1\u30bc\u30c3\u30bf\u30a4\u3002</p>\n<p><a href=\"https://tails.boum.org/\">https://tails.boum.org/</a></p>\n<h2>Whonix</h2>\n<p>\u533f\u540d\u6027\u306b\u91cd\u304d\u3092\u304a\u3044\u305fDistribution<br />\nWhonix-Gateway\u3068Whonix-Workstation\u304c\u30bb\u30c3\u30c8\u3067\u914d\u5e03\u3055\u308c\u3066\u308b\u3002</p>\n<p>Whonix-Gateway\u306f\u3001tor\u63a5\u7d9a\u7528\u306e\u30d7\u30ed\u30ad\u30b7\u3068\u3057\u3066\u4f7f\u3046\u3053\u3068\u304c\u3067\u304d\u308b\u3002<br />\nWindows\u306a\u308aUbuntu\u306a\u308a\u3001\u305d\u306e\u7aef\u672b\u304b\u3089\u51fa\u308b\u901a\u4fe1\u3059\u3079\u3066\u3092tor\u7d4c\u7531\u306b\u3057\u305f\u3044\u5834\u5408\u306b\u3001\u3053\u306eOS\u3092\u901a\u3059\u3068\u4fbf\u5229\u3002</p>\n<p>Whonix-Workstation\u306f\u5b58\u5728\u7406\u7531\u304c\u4e0d\u660e\u3002<br />\nGateway\u3068\u7d44\u307f\u5408\u308f\u305b\u3066\u3044\u3044\u611f\u3058\u306b\u4f7f\u3063\u3066\u306d\u3063\u3066\u3053\u3068\u306a\u306e\u304b\u3082\u3057\u308c\u306a\u3044\u3051\u3069\u3001\u7279\u6bb5\u4f7f\u3046\u7406\u7531\u304c\u306a\u3044\u3057\u4f7f\u3063\u3066\u308b\u4eba\u3082\u898b\u305f\u3053\u3068\u306a\u3044\u3002</p>\n<p><a href=\"https://www.whonix.org/\">https://www.whonix.org/</a></p>\n<p>\u53c2\u8003\u8cc7\u6599: <a href=\"https://no-voids.hatenablog.com/entry/20210926\">IT\u30b7\u30e7\u30b7\u30f3\u30b7\u30e3\u306e\u82e6\u60a9 - Whonix-Gateway\u3092\u69cb\u7bc9\u3057\u3066\u307f\u305f\u4ef6</a></p>\n<h2>Tsurugi Linux</h2>\n<p>\u30a4\u30f3\u30b7\u30c7\u30f3\u30c8\u30ec\u30b9\u30dd\u30f3\u30b9\u30fb\u30c7\u30b8\u30bf\u30eb\u30d5\u30a9\u30ec\u30f3\u30b8\u30c3\u30af\u306b\u91cd\u304d\u3092\u304a\u3044\u305fDistribution  </p>\n<p>\u540d\u524d\u304c\u65e5\u672c\u98a8\u3067\u3044\u3044\u3088\u306d\u3002\u30c4\u30fc\u30eb\u304c\u3044\u3063\u3071\u3044\u5165\u3063\u3066\u3066\u7d50\u69cb\u4f7f\u3044\u3084\u3059\u3044\u3067\u3059\u3002<br />\n\u305d\u306e\u5206\u5bb9\u91cf\u304c\u7d50\u69cb\u30c7\u30ab\u3044\u306e\u3068\u3001\u30df\u30e9\u30fc\u30b5\u30fc\u30d0\u304cEU\u4ed8\u8fd1\u306e\u3082\u306e\u3057\u304b\u306a\u304f\u3066\u3001\u65e5\u672c\u304b\u3089\u3060\u3068\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u306b\u5197\u8ac7\u307f\u305f\u3044\u306a\u6642\u9593\u304c\u304b\u304b\u308a\u307e\u3059\u3002</p>\n<p>\u79c1\u306e\u4f5c\u3063\u305f\u30c4\u30fc\u30eb\u304c\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u307e\u3059\u3002\u5b09\u3057\u3044\u306d\u3002<br />\n<a href=\"https://twitter.com/sum3sh1/status/1492030729194438657\">https://twitter.com/sum3sh1/status/1492030729194438657</a></p>\n<ul>\n<li><a href=\"https://github.com/sumeshi/evtx2es\">sumeshi/evtx2es</a>  </li>\n<li><a href=\"https://github.com/sumeshi/mft2es\">sumeshi/mft2es</a>  </li>\n</ul>\n<p><a href=\"https://tsurugi-linux.org/\">https://tsurugi-linux.org/</a></p>\n<h2>SIFT Workstation</h2>\n<p>\u30a4\u30f3\u30b7\u30c7\u30f3\u30c8\u30ec\u30b9\u30dd\u30f3\u30b9\u30fb\u30c7\u30b8\u30bf\u30eb\u30d5\u30a9\u30ec\u30f3\u30b8\u30c3\u30af\u306b\u91cd\u304d\u3092\u304a\u3044\u305fDistribution<br />\n\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u306e\u306bSANS\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002</p>\n<p>\u3042\u3093\u307e\u308a\u66f4\u65b0\u3055\u308c\u306a\u3044\u3057\u898b\u305f\u76ee\u3082\u53e4\u81ed\u3044\u306e\u3067\u79c1\u306f\u305d\u3093\u306a\u306b\u597d\u304d\u3058\u3083\u306a\u3044\u3067\u3059\u3002<br />\n\u4f7f\u3044\u52dd\u624b\u3082\u5fae\u5999\u306a\u306e\u3067\u3001\u540c\u30da\u30fc\u30b8\u5185\u306b\u3042\u308b\u300cUbuntu\u306bSIFT\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u65b9\u6cd5\u300d\u3067\u30c4\u30fc\u30eb\u4e00\u5f0f\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u305f\u307b\u3046\u304c\u3044\u3044\u304b\u3082\u306d\u3002\u77e5\u3089\u3093\u3051\u3069\u3002</p>\n<p><a href=\"https://www.sans.org/tools/sift-workstation/\">https://www.sans.org/tools/sift-workstation/</a></p>\n<h2>REMnux</h2>\n<p>\u30de\u30eb\u30a6\u30a7\u30a2\u89e3\u6790\u306b\u91cd\u304d\u3092\u304a\u3044\u305fDistribution<br />\n\u30a2\u30a4\u30b3\u30f3\u304c\u304b\u3063\u3053\u3044\u3044\u3067\u3059\u3002\u4f7f\u3044\u52dd\u624b\u306f\u5fae\u5999\u3002</p>\n<p><a href=\"https://remnux.org/\">https://remnux.org/</a></p>\n<h2>Qubes OS</h2>\n<p>\u4f55\u3067\u3082\u304b\u3093\u3067\u3082vm\u3067\u3084\u3063\u3066\u74b0\u5883\u9694\u96e2\u3059\u308b\u3053\u3068\u3067\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3092\u62c5\u4fdd\u3057\u307e\u3057\u3087\u3046\u3088\u3001\u3068\u3044\u3046\u601d\u60f3\u306eOS\u3063\u307d\u3044\u3002<br />\n\u601d\u60f3\u306f\u3059\u3054\u304f\u597d\u304d\u3060\u3051\u3069UI\u304c\u30c0\u30b5\u3044\u306e\u3067\u4f7f\u3063\u305f\u3053\u3068\u306a\u3044\u3002</p>\n<p>\u666e\u6bb5\u9063\u3044PC\u3067\u60aa\u3044\u3053\u3068\u3059\u308b\u4eba\u306b\u306f\u304b\u306a\u308a\u3088\u3055\u305d\u3046\u3002<br />\n\u3042\u3068\u30b9\u30da\u30c3\u30af\u306b\u306f\u304b\u306a\u308a\u4f59\u88d5\u3092\u3082\u305f\u305b\u308b\u5fc5\u8981\u304c\u3042\u308a\u305d\u3046\u306a\u306e\u3067\u30c7\u30b9\u30af\u30c8\u30c3\u30d7\u3068\u304b\u304c\u3044\u3044\u306e\u304b\u306a\u3002</p>\n<p><a href=\"https://www.qubes-os.org/\">https://www.qubes-os.org/</a></p>\n<h2>Subgraph OS</h2>\n<p>\u533f\u540d\u6027\u306b\u91cd\u304d\u3092\u304a\u3044\u305fOS\u3089\u3057\u3044\u3002\u4f7f\u3063\u305f\u3053\u3068\u306a\u3044\u3002<br />\n\u5168\u7136\u66f4\u65b0\u3055\u308c\u3066\u306a\u3044\u3051\u3069\u3053\u308c\u306f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u9813\u632b\u3057\u3066\u308b\u306e\u304b...\uff1f</p>\n<p><a href=\"https://subgraph.com/\">https://subgraph.com/</a></p>\n<h2>\u5f8c\u3067\u66f8\u304f</h2>\n<ul>\n<li>deft linux</li>\n<li>blackarch linux</li>\n<li>kodachi</li>\n</ul>", "published_at": "2023-02-08"}