{"title": "pyinstaller-to-nuitka", "heading": "PyInstaller\u306f\u30ad\u30c4\u3044\u306e\u3067Nuitka\u3092\u4f7f\u3046", "path": "knowledges/pyinstaller-to-nuitka", "html_text": "<h1>PyInstaller\u306f\u30ad\u30c4\u3044\u306e\u3067Nuitka\u3092\u4f7f\u3046</h1>\n<p>\u3088\u304f\u5fd8\u308c\u308b\u306e\u3067\u5099\u5fd8\u9332</p>\n<h2>Nuitka\u3068\u306f</h2>\n<p><a href=\"https://nuitka.net/\">https://nuitka.net/</a></p>\n<p>Python\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u5f62\u5f0f\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u3067\u3059\u3002<br />\n\u4eca\u307e\u3067PyInstaller\u3068\u3044\u3046\u306e\u3092\u4f7f\u3063\u3066\u3044\u305f\u3093\u3067\u3059\u304c\u3001\u304b\u306a\u308a\u3057\u3093\u3069\u3044\u306e\u3067\u4e57\u308a\u63db\u3048\u307e\u3057\u305f\u3002 </p>\n<p>GitHub\u3067\u516c\u958b\u3057\u3066\u308b\u30bd\u30d5\u30c8\u3082\u305d\u306e\u3046\u3061\u5207\u308a\u66ff\u3048\u3066\u3044\u304f\u4e88\u5b9a\u3067\u3059\u3002\n- <a href=\"https://github.com/sumeshi/ntfsdump\">ntfsdump</a>\n- <a href=\"https://github.com/sumeshi/ntfsfind\">ntfsfind</a></p>\n<p>~~\u6700\u521d\u304b\u3089\u30d0\u30a4\u30ca\u30ea\u5316\u3059\u308b\u3053\u3068\u3092\u898b\u636e\u3048\u3066\u3044\u308b\u306a\u3089\u305d\u3082\u305d\u3082Python\u3067\u66f8\u304b\u306a\u304d\u3083\u3044\u3044\u3093\u3067\u3059\u304c\u3001\u4f5c\u308a\u305f\u3044\u30c4\u30fc\u30eb\u304c\u3044\u3063\u3071\u3044\u3042\u308b\u305b\u3044\u3067\u79c1\u306f\u3064\u3044Python\u3092\u4f7f\u3063\u3066\u3057\u307e\u3044\u307e\u3059\u3002~~</p>\n<h2>PyInstaller\u306e\u554f\u984c</h2>\n<p>\u4e0b\u8a18\u306f\u79c1\u304c\u6c17\u306b\u306a\u3063\u3066\u3044\u305f\u70b9\u3067\u3059</p>\n<h3>\u306a\u3093\u304bpath\u3092\u901a\u3059\u306e\u304c\u3046\u307e\u304f\u3044\u304b\u306a\u3044\u3053\u3068\u304c\u3042\u308b</h3>\n<p>\u5f15\u6570\u3067import\u306epath\u3092\u901a\u3057\u3066\u3042\u3052\u306a\u3044\u3068\u4e0a\u624b\u304f\u3044\u304b\u306a\u3044\u3053\u3068\u304c\u3088\u304f\u3042\u308a\u307e\u3059\u3002<br />\n\u305d\u3082\u305d\u3082src\u30ec\u30a4\u30a2\u30a6\u30c8\u304cpython\u3060\u3068\u5c11\u6570\u6d3e\u3063\u307d\u3044\u306e\u3067\u3042\u3093\u307e\u308a\u914d\u616e\u3055\u308c\u3066\u306a\u3044\u3053\u3068\u304c\u3088\u304f\u3042\u308b\u307f\u305f\u3044\u3067\u3059\u306d\u3002</p>\n<p>\u3042\u3068\u52d5\u7684\u30ea\u30f3\u30af\u3055\u308c\u3066\u308b\u30e9\u30a4\u30d6\u30e9\u30ea\u3068\u304b\u3092\u4f7f\u304a\u3046\u3068\u3059\u308b\u3068 <strong>hidden-import</strong> \u30aa\u30d7\u30b7\u30e7\u30f3\u3068\u304b\u3067\u8a2d\u5b9a\u3057\u3066\u3042\u3052\u306a\u304d\u3083\u3044\u3051\u306a\u304f\u3066\u9762\u5012\u306a\u3053\u3068\u304c\u7d50\u69cb\u3042\u308a\u307e\u3057\u305f\u3002</p>\n<h3>\u8d77\u52d5\u6642\u306b\u30de\u30eb\u30a6\u30a7\u30a2\u5224\u5b9a\u3055\u308c\u304c\u3061</h3>\n<p>\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u5165\u3063\u3066\u308bbootloader\u3067\u30d3\u30eb\u30c9\u3059\u308b\u3068\u5272\u308a\u3068\u691c\u77e5\u3055\u308c\u3066\u30a6\u30b6\u3044\u3067\u3059\u3002<br />\n\u30ed\u30fc\u30ab\u30eb\u3067\u30d3\u30eb\u30c9\u3057\u76f4\u3059\u3068\u76f4\u308b\u3063\u307d\u3044\u3093\u3067\u3059\u304c\u3001CI\u3067\u3044\u3061\u3044\u3061\u305d\u3093\u306a\u3053\u3068\u3084\u308a\u305f\u304f\u306a\u3044\u3067\u3059\u3002</p>\n<h2>Nuitka\u3064\u3088</h2>\n<p>Nuitka\u306fpython\u306e\u30bd\u30fc\u30b9\u3092\u4e00\u65e6C\u8a00\u8a9e\u306b\u30c8\u30e9\u30f3\u30b9\u30d1\u30a4\u30eb\u3057\u3066\u30d3\u30eb\u30c9\u3057\u3066\u304f\u308c\u308b\u307f\u305f\u3044\u3067\u3059\u3002<br />\n\u305d\u306e\u305f\u3081PyInstaller\u3068\u6bd4\u8f03\u3057\u3066\u591a\u5c11\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u304c\u826f\u3044\u3089\u3057\u3044\u3067\u3059\u306d\u3002</p>\n<p>\u4f8b\u3048\u3070\u3001<strong>main.py</strong> \u3092\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306b\u3057\u305f\u3044\u5834\u5408\u3001\u6b21\u306e\u3088\u3046\u306b\u30d3\u30eb\u30c9\u3067\u304d\u307e\u3059\u3002</p>\n<pre><code>$ nuitka --follow-imports --onefile main.py\n</code></pre>\n<p>CI\u3067\u5b9f\u884c\u3059\u308b\u3068\u304d\u306b\u306f\u9014\u4e2d\u3067\u5fc5\u8981\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3092\u3057\u3066\u826f\u3044\u304b\u805e\u304b\u308c\u308b\u306e\u3067\u3001\u4e0b\u8a18\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u6709\u52b9\u306b\u3057\u3066\u3042\u3052\u308b\u3068\u3044\u3044\u3063\u307d\u3044\u3067\u3059\u3002</p>\n<pre><code>--assume-yes-for-downloads\n</code></pre>\n<p><a href=\"https://github.com/sumeshi/ntfsdump\">ntfsdump</a> \u3092Nuitka\u306b\u4e57\u308a\u63db\u3048\u3088\u3046\u3068\u3057\u3066\u308b\u3093\u3067\u3059\u3051\u3069\u306a\u3093\u304b\u3046\u307e\u304f\u3044\u304b\u306a\u304f\u3066\u982d\u62b1\u3048\u3066\u307e\u3059\u3002<br />\n\u30ed\u30fc\u30ab\u30eb\u3060\u3068\u3046\u307e\u304f\u3044\u304f\u306e\u306b\uff01\u306a\u305c\uff01\uff01</p>\n<p>\u3088\u304f\u308f\u304b\u3089\u306a\u3044\u306e\u3067\u3072\u3068\u307e\u305a\u5f8c\u56de\u3057\u306b\u3057\u307e\u3059\u3002</p>\n<h2>\u53c2\u8003\u6587\u732e</h2>\n<ul>\n<li><a href=\"https://blog.tsukumijima.net/article/python-nuitka-usage/\">PyInstaller \u3088\u308a\u5727\u5012\u7684\u306b\u512a\u308c\u3066\u3044\u308b Nuitka \u306e\u4f7f\u3044\u65b9\u3068\u30cf\u30de\u3063\u305f\u30dd\u30a4\u30f3\u30c8</a></li>\n<li><a href=\"https://gamingpc.one/dev/python-pyinstaller/\">[Python] Pyinstaller\u3067\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u304c\u30de\u30eb\u30a6\u30a7\u30a2\u306b\u5206\u985e\u3055\u308c\u3066\u3057\u307e\u3063\u305f\u3068\u304d\u306e\u5bfe\u7b56</a></li>\n</ul>\n<h2>\u304a\u307e\u3051</h2>\n<p>\u8eab\u3082\u84cb\u3082\u306a\u3044\u3051\u3069\u3001\u6700\u521d\u304b\u3089Nim\u3068\u304b\u3067\u66f8\u3051\u3070\u826f\u3044\u6c17\u304c\u3059\u308b<br />\n\u5b9f\u884c\u6642\u30b3\u30f3\u30d1\u30a4\u30e9\u306e\u306a\u3044\u8a00\u8a9e\u306a\u3093\u3066\u30b5\u30a4\u30c6\u30fc\uff01</p>", "published_at": "2022-05-22T11:15:19"}